import pandas as pd
data = pd.Series(['SWITZE RLAND','Italy.','france1'])

data.str.len()
#Элементийн уртыг буцаана.

data.str.lower()
#Series -ийн элемент бүрийг жижиг үсэг болгоно.

data.str.translate('a')
#Ямар аrgument өгөхөө ойлгоогүй.

data.str.islower()
#Series дэх string төрлийн элемент жижиг үсгээр эхэлсэн эсэхийг шалгана.

data.str.ljust(20)
#Элементийг зүүн тийш шахна. 10 гэж оруулахад элементүүд 10 үсгийн урттай болно гэж ойлгов.

data.str.upper()
#Элементийн бүх үсгийг том болгоно.

data.str.startswith('S')
#series.str.startswith(‘A’) гэхэд миний үүсгэсэн Series -ийн элементүүд A үсгээр эхэлсэн эсэхийг шалгасан.

data.str.isupper()
#Элементийн үсгүүд бүгд томоор байгааг шалгасан.

data.str.rjust(10)
#Элементүүдийг баруун тийшээ 10 нэгж шахсан гэж ойлголоо.

data.str.find('I')
#хайсан үсэг болон үсгүүд Series -д байвал эхэлж байгаа индексийг заасан.

data.str.endswith('y')
#Заасан үсгээр төгсөж байвал True, үгүй бол False буцаасан.

data.str.isnumeric()
#Тоо эсэхийг шалгана гэж ойлгосон. 

data.str.center(17)
#Төв рүү шахна гэж ойлгов.

data.str.rfind('ra')
#find функц шиг ажиллаж байсан.

data.str.get(1)
#Өгсөн индекс дээрх үсгүүдийг буцаасан.

data.str.isalnum()
#Ямар нэгэн тэмдэгт орсон эсэхийг шалгав.

data.str.isdecimal()
#Бутархай эсэхийг шалгана гэж ойлголоо.

data.str.zfill(20)
#Элемент нь өгсөн индекс рүү тулах хүртэл 0 -ийг дүүргэнэ гэж ойлгосон.

#data.str.index()
#Ажиллуулж чадсангүй

data.str.isalpha()
#Дан үсэг орсон эсэхийг шалгана.

data.str.split()
#Элементүүдийг салгаж list болгодог гэж ойлгов.

data.str.strip('.')
#Өгсөн тэмдэгтийг арилгана. Хэрэв тухайн тэмдэгт байхгүй бол хоосон зайг нөхнө.

#data.str.rindex('a')
#Мөн ажилуулж чадсангүй

data.str.isdigit()
#Бүгд тоо эсэхийг шалгана.

data.str.rsplit()
#Зайтай элементийг тусдаа болгож салгана.

data.str.capitalize()
#Эхний үсгийг том болгоно.

data.str.isspace()
#Хоосон зай байгаа эсэхийг шалгана.

data.str.partition()
#Зайтай элементийг data frame болгосон.

data.str.lstrip()
# strip тэй адилхан боловч эхлэлээс нь хасдаг гэж ойлгосон.

data.str.swapcase()
#Үсэг бүрийн хэлбэрийг өөрчилсөн. Хэрэв том байвал жижиг, жижиг байвал том болгоно.

data.str.istitle()
#Элемент томоор эхэлсэн эсэхийг шалгана.

data.str.rpartition()
#partition тай адилхан боловч баруун тал руу шахсан.

